Merge remote-tracking branch 'origin/pre-develop-1.0.0-beta' into feature/compact_rh_trace
